examples/dfHighSpeedFoam/oneD_detC7H16Mist/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     .0;
    format      ascii;
    class       vectorField;
    location    "constant";
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
60000
(
  (1.500025 0.005 0.0005)
  (1.500075 0.005 0.0005)
  (1.500125 0.005 0.0005)
  (1.500175 0.005 0.0005)
  (1.500225 0.005 0.0005)
  (1.500275 0.005 0.0005)
  (1.500325 0.005 0.0005)
  (1.500375 0.005 0.0005)
  (1.500425 0.005 0.0005)
  (1.500475 0.005 0.0005)
  (1.500525 0.005 0.0005)
  (1.500575 0.005 0.0005)
  (1.500625 0.005 0.0005)
  (1.500675 0.005 0.0005)
  (1.500725 0.005 0.0005)
  (1.500775 0.005 0.0005)
  (1.500825 0.005 0.0005)
  (1.500875 0.005 0.0005)
  (1.500925 0.005 0.0005)
  (1.500975 0.005 0.0005)
  (1.501025 0.005 0.0005)
  (1.501075 0.005 0.0005)
  (1.501125 0.005 0.0005)
  (1.501175 0.005 0.0005)
  (1.501225 0.005 0.0005)
  (1.501275 0.005 0.0005)
  (1.501325 0.005 0.0005)
  (1.501375 0.005 0.0005)
  (1.501425 0.005 0.0005)
  (1.501475 0.005 0.0005)
  (1.501525 0.005 0.0005)
  (1.501575 0.005 0.0005)
  (1.501625 0.005 0.0005)
  (1.501675 0.005 0.0005)
  (1.501725 0.005 0.0005)
  (1.501775 0.005 0.0005)
  (1.501825 0.005 0.0005)
  (1.501875 0.005 0.0005)
  (1.501925 0.005 0.0005)
  (1.501975 0.005 0.0005)
  (1.502025 0.005 0.0005)
  (1.502075 0.005 0.0005)
  (1.502125 0.005 0.0005)
  (1.502175 0.005 0.0005)
  (1.502225 0.005 0.0005)
  (1.502275 0.005 0.0005)
  (1.502325 0.005 0.0005)
  (1.502375 0.005 0.0005)
  (1.502425 0.005 0.0005)
  (1.502475 0.005 0.0005)
  (1.502525 0.005 0.0005)
  (1.502575 0.005 0.0005)
  (1.502625 0.005 0.0005)
  (1.502675 0.005 0.0005)
  (1.502725 0.005 0.0005)
  (1.502775 0.005 0.0005)
  (1.502825 0.005 0.0005)
  (1.502875 0.005 0.0005)
  (1.502925 0.005 0.0005)
  (1.502975 0.005 0.0005)
  (1.503025 0.005 0.0005)
  (1.503075 0.005 0.0005)
  (1.503125 0.005 0.0005)
  (1.503175 0.005 0.0005)
  (1.503225 0.005 0.0005)
  (1.503275 0.005 0.0005)
  (1.503325 0.005 0.0005)
  (1.503375 0.005 0.0005)
  (1.503425 0.005 0.0005)
  (1.503475 0.005 0.0005)
  (1.503525 0.005 0.0005)
  (1.503575 0.005 0.0005)
  (1.503625 0.005 0.0005)
  (1.503675 0.005 0.0005)
  (1.503725 0.005 0.0005)
  (1.503775 0.005 0.0005)
  (1.503825 0.005 0.0005)
  (1.503875 0.005 0.0005)
  (1.503925 0.005 0.0005)
  (1.503975 0.005 0.0005)
  (1.504025 0.005 0.0005)
  (1.504075 0.005 0.0005)
  (1.504125 0.005 0.0005)
  (1.504175 0.005 0.0005)
  (1.504225 0.005 0.0005)
  (1.504275 0.005 0.0005)
  (1.504325 0.005 0.0005)
  (1.504375 0.005 0.0005)
  (1.504425 0.005 0.0005)
  (1.504475 0.005 0.0005)
  (1.504525 0.005 0.0005)
  (1.504575 0.005 0.0005)
  (1.504625 0.005 0.0005)
  (1.504675 0.005 0.0005)
  (1.504725 0.005 0.0005)
  (1.504775 0.005 0.0005)
  (1.504825 0.005 0.0005)
  (1.504875 0.005 0.0005)
...
)
// ************************************************************************* //